In [1]:
import pandas as pd
from math import sqrt

##### Creation Date:
##### February 13 2022
##### Created By Alperen KOLAMUC

#### Data

In [34]:
oyuncular = {"boy":[175,177,178,181,182,183,184,188,190], "deneyim":[4,6,3,2,6,3,7,2,6], "maas":[12,18,15,16,24,20,28,24,32]}

In [35]:
df = pd.DataFrame(oyuncular)
df

   boy  deneyim  maas
0  175        4    12
1  177        6    18
2  178        3    15
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28
7  188        2    24
8  190        6    32

In [ ]:
df.maas

* Eğer biri gelip basketbolcu olsam ne kadar kazanırım dşye sorsa mantıken yapılacak olan basketbolcuların maaşlarının ortalamasını söylemek olacak. Tabiki bu cevap net olmayacaktır. Çünkü genel bir soruya genel bir cevap verildi. Soru detaylanırsa cevapta o kadar nete yakın olacaktır

In [5]:
df.maas.mean()

21.0

In [6]:
df.maas - df.maas.mean()

0    -9.0
1    -3.0
2    -6.0
3    -5.0
4     3.0
5    -1.0
6     7.0
7     3.0
8    11.0
Name: maas, dtype: float64

In [7]:
(df.maas - df.maas.mean()).pow(2) # Negatiften kurtulmak için karesi alınıyor

0     81.0
1      9.0
2     36.0
3     25.0
4      9.0
5      1.0
6     49.0
7      9.0
8    121.0
Name: maas, dtype: float64

#### Mean Model

In [8]:
(df.maas - df.maas.mean()).pow(2).sum() # Error değeri

340.0

#### İlk Kırılım
#### İlk bölme

In [9]:
filt = (df.boy <= 180)

In [10]:
df1 = df[filt]

In [11]:
df2 = df[~filt]

In [12]:
df1

   boy  deneyim  maas
0  175        4    12
1  177        6    18
2  178        3    15

In [13]:
df1.maas.mean()

15.0

In [14]:
df2

   boy  deneyim  maas
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28
7  188        2    24
8  190        6    32

In [15]:
df2.maas.mean()

24.0

* Artık boyu 180'den büyük ve 180'den küçük oyunlar için iki ayrı maaş cevabım oldu

#### İlk Bölme: Error

In [16]:
(df1.maas - df1.maas.mean()).pow(2).sum() + (df2.maas - df2.maas.mean()).pow(2).sum()

178.0

#### İkinci Bölme

In [17]:
filt2 = (df2.boy <= 185)

In [18]:
df3 = df2[filt2]

In [19]:
df4 = df2[~filt2]

In [20]:
df3

   boy  deneyim  maas
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28

In [21]:
df3.maas.mean()

22.0

In [22]:
df4

   boy  deneyim  maas
7  188        2    24
8  190        6    32

In [23]:
df4.maas.mean()

28.0

#### İkinci Bölme: Error

In [24]:
(df1.maas - df1.maas.mean()).pow(2).sum() + (df3.maas - df3.maas.mean()).pow(2).sum() + (df4.maas - df4.maas.mean()).pow(2).sum()

130.0

#### Üçüncü Bölme

In [25]:
filt3 = (df3.deneyim <= 5)

In [26]:
df5 = df3[filt3]

In [27]:
df6 = df3[~filt3]

In [28]:
df5

   boy  deneyim  maas
3  181        2    16
5  183        3    20

In [29]:
df5.maas.mean()

18.0

In [30]:
df6

   boy  deneyim  maas
4  182        6    24
6  184        7    28

In [31]:
df6.maas.mean()

26.0

#### Üçüncü Bölme: Error

In [32]:
(df1.maas - df1.maas.mean()).pow(2).sum() + (df4.maas - df4.maas.mean()).pow(2).sum() + (df5.maas - df5.maas.mean()).pow(2).sum() + (df6.maas - df6.maas.mean()).pow(2).sum()

66.0

* Şimdi sıkıntı şurada bu güzel öğreniyor ama otomatik değil ve optimal soruyu neye göre seçeceğim. Deneyim + yaş mı? yaş + boy mu?

* Bütün parametrelere göre ayrı ayrı sorulur en düşük erroru veren paramtre kırılım sorusu olur

In [33]:
df

   boy  deneyim  maas
0  175        4    12
1  177        6    18
2  178        3    15
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28
7  188        2    24
8  190        6    32

* Burada boylar colm'unda 9 unique, eneyim'de 5 unique değer var. Toplam 14 faklı durum var. 14 Soruyuda soralım o zaman.
* 1) boy <= 175
* 2) boy <= 177
* 3) boy <= 178
*   ....
* 14) boy <= 190
* Bu sorulardan farklı faklı error değerleri çıkacak. Bu error değerlerinden en küçüğü benim birinci sorum olur ve artık birinci sorumun cevabı ile oluşacak yeni dataframe'mime aynı işlmeleri uygulayarak bir kara ağacı oluşturmuş olurum. Bunun adıda `decision tree`'dir